[M_ColdShoulder MissionDefinition]
MissionDescription="Lenny falls in love with Scooter in the mouse hole.. Scooter asks you to bring him flowers and Lenny's favorite food instead of food in his fridge (home), hoping he'll become a normal person.. "
TurnInDescription="Lenny prefers being alone with the animals rather than spending time with Scooter or his friends.."
